CalculationRegisters/Начисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<CalculationRegister>
		<Properties>
			<Name>Начисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботы</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботы.Resource.Значение</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботы.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыГрафиковРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходныеДанные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

CommonModules/ПроведениеРасчетов/Ext/Module.bsl
// ОбщийМодуль.ПроведениеРасчетов.Модуль
Процедура РассчитатьНачисления(НаборЗаписейРегистра, ТребуемыйВидРасчета, СписокСотрудников) Экспорт
    Регистратор = НаборЗаписейРегистра.Отбор.Регистратор.Значение;
    
    // --- Блок расчета Оклада ---
    Если ТребуемыйВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.Оклад Тогда
        Запрос = Новый Запрос;
        // *** ИСПРАВЛЕНИЕ: Очищенный и уплотненный текст запроса ***
        Запрос.Текст =
        "ВЫБРАТЬ
        |	НачисленияДанныеГрафика.ЗначениеПериодДействия КАК Норма,
        |	НачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК Факт,
        |	НачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки
        |ИЗ
        |	РегистрРасчета.Начисления.ДанныеГрафика(
        |			Регистратор = &Регистратор
        |				И ВидРасчета = &ВидРасчета
        |				И Сотрудник В (&СписокСотрудников)) КАК НачисленияДанныеГрафика";
        // ----------------------------------------------------------------
        
        Запрос.УстановитьПараметр("Регистратор", Регистратор);
        Запрос.УстановитьПараметр("ВидРасчета", ТребуемыйВидРасчета);
        Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников); 
        
        ВыборкаРезультата = Запрос.Выполнить().Выбрать();
        
        Для Каждого ЗаписьРегистра Из НаборЗаписейРегистра Цикл
            СтруктураНомер = Новый Структура("НомерСтроки");
            СтруктураНомер.НомерСтроки = ЗаписьРегистра.НомерСтроки;
            ВыборкаРезультата.Сбросить();
            
            Если ВыборкаРезультата.НайтиСледующий(СтруктураНомер) Тогда
                
                ИсходныеДанныеЧисло = 0;
                Попытка
                    // *** ИСПРАВЛЕНИЕ: Гарантируем, что ИсходныеДанные — это число ***
                    ИсходныеДанныеЧисло = Число(ЗаписьРегистра.ИсходныеДанные);
                Исключение
                    ИсходныеДанныеЧисло = 0;
                    Сообщить("Ошибка преобразования ИсходныхДанных в число при расчете Оклада. Использовано 0.", СтатусСообщения.Важное);
                КонецПопытки;
                
                Если ВыборкаРезультата.Норма = 0 Тогда
                    Сообщить("Вид расчета: Оклад – Нет рабочих дней в заданном периоде. Результат 0.");
                    ЗаписьРегистра.Результат = 0;
                Иначе
                    // Расчет оклада: (ИсходныеДанныеЧисло / Норма) * Факт
                    ЗаписьРегистра.Результат = (ИсходныеДанныеЧисло / ВыборкаРезультата.Норма) * ВыборкаРезультата.Факт;
                    
                    Сообщить("Выполнен расчет " + ЗаписьРегистра.Регистратор + " – " + ЗаписьРегистра.ВидРасчета + " – " + ЗаписьРегистра.Сотрудник);
                КонецЕсли;
            КонецЕсли;
        КонецЦикла;
        
    // --- Блок расчета Премии ---
    ИначеЕсли ТребуемыйВидРасчета = ПланыВидовРасчета.ОсновныеНачисления.Премия Тогда
        Запрос = Новый Запрос;
        Запрос.Текст =
        "ВЫБРАТЬ
        | ЕСТЬNULL(НачисленияБазаНачисления.РезультатБаза, 0) КАК База,
        | НачисленияБазаНачисления.НомерСтроки КАК НомерСтроки
        |ИЗ
        | РегистрРасчета.Начисления.БазаНачисления(&ИзмеренияОсновного,
        | &ИзмеренияБазового, , Регистратор = &Регистратор И ВидРасчета = &ВидРасчета И Сотрудник В (&СписокСотрудников))
        | КАК НачисленияБазаНачисления";
        Измер = Новый Массив(1);
        Измер[0] = "Сотрудник";                   
        
        Запрос.УстановитьПараметр("ИзмеренияОсновного", Измер);
        Запрос.УстановитьПараметр("ИзмеренияБазового", Измер);
        Запрос.УстановитьПараметр("Регистратор", Регистратор);
        Запрос.УстановитьПараметр("ВидРасчета", ТребуемыйВидРасчета);
        Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);  
        
        ВыборкаРезультата = Запрос.Выполнить().Выбрать(); 
        
        Для Каждого ЗаписьРегистра Из НаборЗаписейРегистра Цикл
            СтруктураНомер = Новый Структура("НомерСтроки");
            СтруктураНомер.НомерСтроки = ЗаписьРегистра.НомерСтроки;
            ВыборкаРезультата.Сбросить();
            
            Если ВыборкаРезультата.НайтиСледующий(СтруктураНомер) Тогда
                // База гарантированно число благодаря ЕСТЬNULL в запросе
                ЗаписьРегистра.Результат = ВыборкаРезультата.База * 0.10;
                
                Сообщить("Выполнен расчет " + ЗаписьРегистра.Регистратор + " – " + ЗаписьРегистра.ВидРасчета + " – " + ЗаписьРегистра.Сотрудник);
            КонецЕсли;
        КонецЦикла;
    КонецЕсли;
КонецПроцедуры    


Процедура ПерерассчитатьНачисления(ТребуемыйВидРасчета) Экспорт
	// Здесь следует выбрать из набора записей перерасчета записи в следующей последовательности:
	// записи документа1 для сотрудников из списка,
	// записи документа2 для сотрудников из списка и т. д.
	Запрос = Новый Запрос(
			"ВЫБРАТЬ    
			| НачисленияПерерасчет.ОбъектПерерасчета,
			| НачисленияПерерасчет.Сотрудник
			|ИЗ
			| РегистрРасчета.Начисления.Перерасчет КАК НачисленияПерерасчет
			|ГДЕ
			| НачисленияПерерасчет.ВидРасчета = &ТребуемыйВидРасчета
			|ИТОГИ ПО
			| НачисленияПерерасчет.ОбъектПерерасчета");           
	
	Запрос.УстановитьПараметр("ТребуемыйВидРасчета", ТребуемыйВидРасчета);
	СписокСотрудников = Новый СписокЗначений;
	// Перебрать группировку по регистратору.        
	
	ВыборкаПоРегистратору = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);    
	
	Пока ВыборкаПоРегистратору.Следующий() Цикл
		Регистратор = ВыборкаПоРегистратору.ОбъектПерерасчета;
		// Перебрать группировку по сотрудникам для выбранного регистратора
		// и создать список сотрудников.
		ВыборкаПоСотрудникам = ВыборкаПоРегистратору.Выбрать();
		СписокСотрудников.Очистить();    
		
		Пока ВыборкаПоСотрудникам.Следующий() Цикл
			СписокСотрудников.Добавить(ВыборкаПоСотрудникам.Сотрудник);
		КонецЦикла;    
		
		// Получить набор записей регистра расчета для выбранного регистратора.
		НаборЗаписей = РегистрыРасчета.Начисления.СоздатьНаборЗаписей();      
		
		НаборЗаписей.Отбор.Регистратор.Значение = Регистратор;
		НаборЗаписей.Прочитать();   
		
		РассчитатьНачисления(НаборЗаписей, ТребуемыйВидРасчета, СписокСотрудников);
		НаборЗаписей.Записать( , Истина);  
		
		// Очистить перерассчитанные записи в перерасчете.
		НаборЗаписейПерерасчета = РегистрыРасчета.Начисления.Перерасчеты.Перерасчет.СоздатьНаборЗаписей();
		НаборЗаписейПерерасчета.Отбор.ОбъектПерерасчета.Значение = Регистратор;
		НаборЗаписейПерерасчета.Записать();
	КонецЦикла;
КонецПроцедуры
